/*
Задание на функции
1. Переписать абонентский справочник с использованием функций.
2. Имеется программа (исходный код которой приводится ниже,
компилировать с ключами: -fno-stack-protector -no-pie). Вам необходимо
произвести анализ программы с помощью отладчика для выяснения длины
массива для ввода пароля и адреса ветки условия проверки корректности
ввода пароля, которая выполняется при условии совпадения паролей.
Ввести пароль (строку символов) таким образом, чтобы перезаписать адрес
возврата на выясненный адрес (есть символы которые нельзя ввести с
клавиатуры, поэтому можно использовать перенаправление ввода(<) при
запуске программы).
*/
